<?PHP
//ÅÔÆ»ÉÜ¸©É½¼¨
class ListKen
{
 var $defKen    = "";
 var $ken       ="";

	function outputKen($defKen){
		$ken = array(
			'ËÌ³¤Æ»',
			'ÀÄ¿¹¸©',
			'´ä¼ê¸©',
			'µÜ¾ë¸©',
			'½©ÅÄ¸©',
			'»³·Á¸©',
			'Ê¡Åç¸©',
			'°ñ¾ë¸©',
			'ÆÊÌÚ¸©',
			'·²ÇÏ¸©',
			'ºë¶Ì¸©',
			'ÀéÍÕ¸©',
			'ÅìµþÅÔ',
			'¿ÀÆàÀî¸©',
			'¿·³ã¸©',
			'ÉÙ»³¸©',
			'ÀÐÀî¸©',
			'Ê¡°æ¸©',
			'»³Íü¸©',
			'Ä¹Ìî¸©',
			'´ôÉì¸©',
			'ÀÅ²¬¸©',
			'°¦ÃÎ¸©',
			'»°½Å¸©',
			'¼¢²ì¸©',
			'µþÅÔÉÜ',
			'ÂçºåÉÜ',
			'Ê¼¸Ë¸©',
			'ÆàÎÉ¸©',
			'ÏÂ²Î»³¸©',
			'Ä»¼è¸©',
			'Åçº¬¸©',
			'²¬»³¸©',
			'¹­Åç¸©',
			'»³¸ý¸©',
			'ÆÁÅç¸©',
			'¹áÀî¸©',
			'°¦É²¸©',
			'¹âÃÎ¸©',
			'Ê¡²¬¸©',
			'º´²ì¸©',
			'Ä¹ºê¸©',
			'·§ËÜ¸©',
			'ÂçÊ¬¸©',
			'µÜºê¸©',
			'¼¯»ùÅç¸©',
			'²­Æì¸©'
		);

		foreach($ken as $key => $value ){
			if($value == $defKen ){
				print "<option selected>$value</option>";
			}else{
				print "<option >$value</option>";
			}
		}

	return;	
	}
}
?>